{
  "backend/main.mo": "Motoko actor that includes blob storage mixin and provides functions to add and retrieve images with PNG/JPG filtering and sorting capabilities.",
  "feature_evidence.json": "Feature evidence report documenting four implemented features related to adding a blog section with navigation, data structures, and a specific blog post entry.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files describing components, pages, hooks, types, and configuration for a game designer portfolio application.",
  "frontend/DEPLOYMENT.md": "Deployment guide with build/deploy steps, verification checklist, and detailed custom domain setup instructions for VikalpGameDesign.com on Internet Computer.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining light and dark theme variables optimized for a purple-themed gaming aesthetic.",
  "frontend/index.html": "HTML entry point with SEO-optimized title and canonical link pointing to vikalpgamedesign.com.",
  "frontend/src/App.tsx": "Root application component wrapping Portfolio page with ThemeProvider, DataInitializer, and Toaster for notifications.",
  "frontend/src/components/AboutSection.tsx": "Hero section component displaying profile image with LinkedIn overlay button, name, career summary, and call-to-action buttons with animated background.",
  "frontend/src/components/BlogSection.tsx": "Section component rendering blog posts in a card grid with titles, descriptions, dates, and external link buttons styled consistently with other portfolio sections.",
  "frontend/src/components/ContactSection.tsx": "Contact form component with name, email, and message fields that submits via useSubmitContactForm hook. Displays contact information, social links (especially LinkedIn), and shows toast notifications on form submission success/failure.",
  "frontend/src/components/DataInitializer.tsx": "Empty component that returns null; previously handled backend portfolio data initialization but now all data is static in frontend/src/data/portfolioData.ts.",
  "frontend/src/components/Footer.tsx": "Simple footer component displaying copyright notice with a heart icon and attribution link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Fixed navigation header with logo, desktop/mobile menus, smooth scrolling to sections, and active section highlighting. Includes scroll-based backdrop blur effect and responsive mobile menu toggle.",
  "frontend/src/components/PortfolioLinksSection.tsx": "Displays a grid of external portfolio links as cards with titles, descriptions, and external link icons. Returns null if no links are provided.",
  "frontend/src/components/ProjectsSection.tsx": "Featured projects grid displaying project cards with images/screenshots, title, description, role details, and hover effects. Shows placeholder icon if no screenshot is available.",
  "frontend/src/components/SkillsSection.tsx": "Two-column layout displaying soft skills (Project Management, Teamwork, etc.) and hard skills (Level Design, Game Mechanics, etc.) with icon-decorated cards.",
  "frontend/src/components/WorkExperienceSection.tsx": "Timeline-style work experience section with alternating left/right layout, displaying job title, company, period, and description with visual timeline dots and connecting line.",
  "frontend/src/data/portfolioData.ts": "Exports static portfolio data including personal info, work experiences, projects, and blog posts for Vikalp Singh, a game designer with 3.5+ years of experience.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages an ICP actor instance based on Internet Identity authentication state, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login/logout state and identity persistence using DFINITY's AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching portfolio content and blog posts from static data, with a simulated contact form submission since backend support was removed.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark theme colors using OKLCH color space, plus base styles for smooth scrolling and typography.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the root App component.",
  "frontend/src/pages/Portfolio.tsx": "Main portfolio page component that fetches portfolio data, tracks active section on scroll, and renders all portfolio sections with loading and error states.",
  "frontend/src/types/portfolio.ts": "TypeScript type definitions for portfolio data structures including About, Experience, Project, ContactInfo, SocialLink, PortfolioLink, and BlogPost interfaces.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom colors using OKLCH, container settings, border radius variables, and animation keyframes for accordions.",
  "project_state.json": "Project state tracking file for a portfolio website with existing blog section features and navigation updates. Contains metadata about implemented features for displaying blog posts with external links and a pending feature request for additional blog content."
}