{
  "backend/main.mo": "Motoko canister storing images with a list-based API, allowing adding images and querying sorted results by PNG flag.",
  "feature_evidence.json": "Empty feature evidence report structure.",
  "frontend-file-summaries.txt": "Prewritten summaries of all frontend source files for reference.",
  "frontend/DEPLOYMENT.md": "Deployment guide with steps for building, deploying, verifying, and configuring a custom domain for the frontend.",
  "frontend/index.css": "Tailwind base styles and OKLCH color variables defining light and dark theme palettes.",
  "frontend/index.html": "HTML entry file setting the page title, canonical link, and loading the React app.",
  "frontend/src/App.tsx": "Root component configuring theme provider, data initializer, portfolio page, and toaster.",
  "frontend/src/components/AboutSection.tsx": "Hero-style about section showing profile image, LinkedIn overlay, name, summary, and navigation button.",
  "frontend/src/components/ContactSection.tsx": "Contact form with validation, toast feedback, social link handling, and submission via React Query.",
  "frontend/src/components/DataInitializer.tsx": "No-op component since data initialization is now static.",
  "frontend/src/components/Footer.tsx": "Footer showing copyright and caffeine.ai attribution.",
  "frontend/src/components/Header.tsx": "Sticky navigation header with scroll detection, mobile menu, and smooth section navigation.",
  "frontend/src/components/PortfolioLinksSection.tsx": "Renders a grid of external portfolio links as cards with titles and visit buttons. Returns null if no links are provided.",
  "frontend/src/components/ProjectsSection.tsx": "Displays a featured projects grid with screenshots, descriptions, and role details. Handles missing screenshots and includes hover effects.",
  "frontend/src/components/SkillsSection.tsx": "Shows categorized soft and hard skills in two styled cards. Uses static skill lists and decorative icons.",
  "frontend/src/components/WorkExperienceSection.tsx": "Displays a vertical timeline of work experiences with alternating layout. Each entry includes period, title, company, and description.",
  "frontend/src/data/portfolioData.ts": "Provides static portfolio data including about info, experiences, and projects. Used as the source content for portfolio queries.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity, refetching dependent queries when identity changes. Returns the current actor and fetch status.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity context with login, logout, and identity loading via AuthClient. Exposes identity state, status flags, and provider setup.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks returning static portfolio data and a simulated contact form submission. Uses small delays for smoother UX.",
  "frontend/src/index.css": "Sets up Tailwind layers and defines light/dark theme CSS variables with base styles and a custom utility.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and imports global styles.",
  "frontend/src/pages/Portfolio.tsx": "Renders the portfolio page with section-based scrolling state and handles loading and error states for fetched portfolio data.",
  "frontend/src/types/portfolio.ts": "Defines TypeScript interfaces for all portfolio-related data structures used in the frontend.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom color tokens, radius, animations, plugins, and content paths.",
  "project_state.json": "Describes the project’s deployment state, issues, and feature requests related to ICP hosting."
}