{
  "backend/main.mo": "Motoko canister storing portfolio data, exposing queries and mutations for projects, experiences, social links, and contact submissions.",
  "feature_evidence.json": "Machine‑generated report mapping implemented features to affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of major frontend React components, hooks, and configuration files.",
  "frontend/DEPLOYMENT.md": "Guide detailing how to build, deploy, verify, and troubleshoot the React frontend on the Internet Computer.",
  "frontend/index.css": "Tailwind base and theme variable definitions providing a light/dark OKLCH color system for the UI.",
  "frontend/index.html": "HTML root document containing the mounting point and script loader for the React application.",
  "frontend/src/App.tsx": "Main app wrapper providing theme support, data seeding, toast notifications, and rendering the Portfolio page.",
  "frontend/src/components/AboutSection.tsx": "Hero section displaying the user's profile, summary, and navigation buttons with animated visuals.",
  "frontend/src/components/ContactSection.tsx": "Contact form component with validation, async submission via React Query, and social link icons.",
  "frontend/src/components/DataInitializer.tsx": "Initializes portfolio data by fetching content, uploading a default profile image, and adding missing predefined projects.",
  "frontend/src/components/Footer.tsx": "Renders a footer with copyright text and a link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Displays a responsive header with scroll-based styling, navigation links, and a mobile menu.",
  "frontend/src/components/ProjectsSection.tsx": "Shows a grid of project cards including images, descriptions, and role details.",
  "frontend/src/components/WorkExperienceSection.tsx": "Renders a timeline-style list of work experiences with period, title, company, and description.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on the user's identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and helpers for managing Internet Identity authentication and state.",
  "frontend/src/hooks/useQueries.ts": "Contains React Query hooks for loading portfolio content and submitting contact forms via the backend.",
  "frontend/src/index.css": "Initializes Tailwind layers and defines OKLCH-based CSS variables for light and dark themes with utility overrides.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and InternetIdentity providers.",
  "frontend/src/pages/Portfolio.tsx": "Renders the portfolio page with section tracking, loading and error states, and content sections populated from usePortfolioContent.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom OKLCH color variables, radius, animations, and plugins including typography and container queries.",
  "project_state.json": "Tracks project metadata, known issues, and implemented features related to fixing loading behavior and redeployment."
}