{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix React Query split-cache and add portfolio load error+retry UI",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Remove nested React Query QueryClientProvider in App so the app uses the single shared QueryClient from main.tsx.",
      "acceptanceCriteria": [
        "`frontend/src/App.tsx` no longer creates/exports its own `QueryClient` or wraps the app in an additional `QueryClientProvider`.",
        "React Query hooks (`useActor`, `usePortfolioContent`, mutations, and `DataInitializer` invalidations) all use the same cache and behave consistently (no split-cache behavior)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Delete the local QueryClient creation and remove the nested QueryClientProvider wrapper; render ThemeProvider + DataInitializer + Portfolio + Toaster directly so the QueryClientProvider in frontend/src/main.tsx is the only provider."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Add an explicit error state and retry action on the Portfolio page for usePortfolioContent failures to avoid indefinite loading UX.",
      "acceptanceCriteria": [
        "If `getPortfolioContent()` fails, the Portfolio page shows an English error message and a visible retry control that triggers a refetch.",
        "The loading spinner is only shown while the query is actively loading; users are not left on an indefinite spinner when an error occurs."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Portfolio.tsx",
          "operation": "modify",
          "description": "Extend usePortfolioContent usage to handle error state (e.g., isError/error) and render an English error message with a visible retry control wired to refetch(); keep spinner only for active loading state."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Ensure usePortfolioContent exposes the necessary React Query state for the Portfolio page (error/isError/refetch) and adjust query options if needed to prevent \"stuck\" UX on failures (while keeping behavior compatible with the shared QueryClient)."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Document and verify the frontend build/deploy steps after the loading fix so the deployed preview renders portfolio sections without indefinite loading.",
      "acceptanceCriteria": [
        "A fresh build/deploy completes successfully.",
        "Opening the preview loads the portfolio page and renders the About, Experience, Projects, and Contact sections without indefinite loading."
      ],
      "file_operations": [
        {
          "path": "frontend/DEPLOYMENT.md",
          "operation": "create",
          "description": "Add a short redeploy checklist focused on the frontend (clean install/build steps, what to verify in the preview, and confirmation that Portfolio loads and renders About/Experience/Projects/Contact without indefinite loading)."
        }
      ]
    }
  ]
}